This material should help you get the ideas clearer from the first meeting:

In [ ]:
names=["Tom√°s", "Pauline", "Pablo", "Bjork","Alan","Juana"]
woman=[False,True,False,False,False,True]
ages=[32,33,28,30,32,27]
country=["Chile", "Senegal", "Spain", "Norway","Peru","Peru"]
education=["Bach", "Bach", "Master", "PhD","Bach","Master"]

# now in a dict:
data={'name':names, 'age':ages, 'girl':woman,'born In':country, 'degree':education}
#name of the column followed by the list that populates it

#now into a DF
import pandas as pd

friends=pd.DataFrame.from_dict(data)
# seeing it:
friends

The result is what you expected, but you need to be sure of what data structure you have:

In [ ]:
#what is it?
type(friends)

In [ ]:
#this is good
friends.age
#shows the column of age

In [ ]:
#what is it?
type(friends.age)
#'series' is a column for pandas - no longer a 'list'
#point of this is that some operations only work with certain data structures

In [ ]:
#this is good
friends['age']
#no big difference between calling it with [] or with . -- but when you have a space in column name like in 'born In' 
#you need to use ['']
#clean names, no special characters - it's a litte faster to use .

In [ ]:
#what is it?
type(friends['age'])

In [ ]:
#this is bad
friends.iloc[['age']]

In [ ]:
#this is bad
friends.loc[['age']]

In [ ]:
#this is bad
friends['age','born In']

In [11]:
#this is good
friends[['age','born In']]
#to show multiple columns, use two square brackets

   age  born In
0   32    Chile
1   33  Senegal
2   28    Spain
3   30   Norway
4   32     Peru
5   27     Peru

In [12]:
# what is it?
type(friends[['age','born In']])
#two series becomes a data frame

pandas.core.frame.DataFrame

In [ ]:
#this is bad
friends.'born In'

In [13]:
#this is good
friends.loc[:,['age','born In']]
#the : calls all rows, the [] calls those particular columns

   age  born In
0   32    Chile
1   33  Senegal
2   28    Spain
3   30   Norway
4   32     Peru
5   27     Peru

In [14]:
type(friends.loc[:,['age','born In']])

pandas.core.frame.DataFrame

In [ ]:
#this is bad
#loc can use names of columns, iloc uses positions
friends.loc[:,['age':'born In']]

In [ ]:
#this is bad
friends.iloc[:,['age','born In']]

In [17]:
# this is good (but different)
friends.iloc[:,1:4]

   age   girl  born In
0   32  False    Chile
1   33   True  Senegal
2   28  False    Spain
3   30  False   Norway
4   32  False     Peru
5   27   True     Peru

In [18]:
# what is it?
type(friends.iloc[:,1:4])

pandas.core.frame.DataFrame

In [20]:
# this is good
friends.iloc[:,[1,3]]
# iloc accepts a list of indexes but not a list of names

   age  born In
0   32    Chile
1   33  Senegal
2   28    Spain
3   30   Norway
4   32     Peru
5   27     Peru

In [21]:
#what is it?
type(friends.iloc[:,[1,3]])

pandas.core.frame.DataFrame

Most of our operations are done on Data frames, because they have several columns and we used that for the subsetting:

In [22]:
friends[friends.age>30]
#subset of the data frame
#friends given friends.age is greater than 30

      name  age   girl  born In degree
0    Tom√°s   32  False    Chile   Bach
1  Pauline   33   True  Senegal   Bach
4     Alan   32  False     Peru   Bach

Some people like coding with the filter language:

In [23]:
# 
filter1=friends.age>30
friends[filter1]
#this will work fine

      name  age   girl  born In degree
0    Tom√°s   32  False    Chile   Bach
1  Pauline   33   True  Senegal   Bach
4     Alan   32  False     Peru   Bach

In [24]:
friends.where(filter1)
#almost the same results - just gives you missing values instead of removed rows
#more similar to natural language than friends[filter1]
#possibly increases readability, but it does make changes to the data

      name   age  girl  born In degree
0    Tom√°s  32.0   0.0    Chile   Bach
1  Pauline  33.0   1.0  Senegal   Bach
2      NaN   NaN   NaN      NaN    NaN
3      NaN   NaN   NaN      NaN    NaN
4     Alan  32.0   0.0     Peru   Bach
5      NaN   NaN   NaN      NaN    NaN

In [25]:
filter1a='age>30'
friends.query(filter1a)
#this is what you got from using the brackets 
#the filter here uses more natural language - has to be text, doesn't use the name of the dataframe in the filter
#when you use query - it will use the last data frame it has in memory (unlike the brackets and where, which use entire df)

      name  age   girl  born In degree
0    Tom√°s   32  False    Chile   Bach
1  Pauline   33   True  Senegal   Bach
4     Alan   32  False     Peru   Bach

In [26]:
isinstance(friends[filter1], pd.DataFrame), \
isinstance(friends.where(filter1), pd.DataFrame), \
isinstance(friends.query(filter1a), pd.DataFrame)

#use the backslash to get new lines - make more readable
#the point: as long as you are getting data frames, you can keep doing operations
#the order of your subsetting is important

(True, True, True)

When you have Boolean values (True/False) you can simplify:

In [27]:
#from:
friends[friends.girl==False]

    name  age   girl born In  degree
0  Tom√°s   32  False   Chile    Bach
2  Pablo   28  False   Spain  Master
3  Bjork   30  False  Norway     PhD
4   Alan   32  False    Peru    Bach

In [28]:
# to...
friends[~friends.girl]

    name  age   girl born In  degree
0  Tom√°s   32  False   Chile    Bach
2  Pablo   28  False   Spain  Master
3  Bjork   30  False  Norway     PhD
4   Alan   32  False    Peru    Bach

You can have two filters:

In [ ]:
# this will not work
friends[~friends.girl & friends.degree=='Bach']

In [30]:
# this will (with parentheses)
friends[(~friends.girl) & (friends.degree=='Bach')]

    name  age   girl born In degree
0  Tom√°s   32  False   Chile   Bach
4   Alan   32  False    Peru   Bach

Other times you want a values once a filter was applied:

In [31]:
# youngest male:
friends[(~friends.girl) & (friends.age.min())] # this is wrong!
#friends.age.min() is not a filter! you aren't asking that it to compare with anythin (<,>, ==, etc)

    name  age   girl born In  degree
0  Tom√°s   32  False   Chile    Bach
2  Pablo   28  False   Spain  Master
3  Bjork   30  False  Norway     PhD
4   Alan   32  False    Peru    Bach

In [35]:
friends[(~friends.girl) & (friends.age==friends.age.min())] # this is wrong too!
#here we've got a filter, but it's a wrong one - there's no boy who's 27 (the mins age in the whole data frame)

Empty DataFrame
Columns: [name, age, girl, born In, degree]
Index: []

In [33]:
friends.age.min()

27

You got empty answer because there is no man aged 27.

In [37]:
# this is correct
friends[~friends.girl].age.min()
#once you've got a subset (~girl), then look at age, then find the min of those
#can use '#' to check your code along the way

28

Once you know the right age, you have to put it in the right place:

In [38]:
friends[friends.age==friends[~friends.girl].age.min()]

    name  age   girl born In  degree
2  Pablo   28  False   Spain  Master

In [39]:
# or
friends.where(friends.age==friends[~friends.girl].age.min())

    name   age  girl born In  degree
0    NaN   NaN   NaN     NaN     NaN
1    NaN   NaN   NaN     NaN     NaN
2  Pablo  28.0   0.0   Spain  Master
3    NaN   NaN   NaN     NaN     NaN
4    NaN   NaN   NaN     NaN     NaN
5    NaN   NaN   NaN     NaN     NaN

In [42]:
# or
friends.where(friends.age==friends[~friends.girl].age.min()).dropna()
#dropna gets rid of the rows where there is at least one missing value - can be dangerous
#give me somebody who is as young as the youngest boy (this might not be a boy though!)

    name   age  girl born In  degree
2  Pablo  28.0   0.0   Spain  Master

The problem is that 'friends' are not subset and the age keeps being that of the youngest woman:

In [41]:
# bad:
friends.where(~friends.girl).where(friends.age==friends.age.min())
#problem is that 2nd where is looking at full 'friends' dataframe from the begining

  name  age  girl born In degree
0  NaN  NaN   NaN     NaN    NaN
1  NaN  NaN   NaN     NaN    NaN
2  NaN  NaN   NaN     NaN    NaN
3  NaN  NaN   NaN     NaN    NaN
4  NaN  NaN   NaN     NaN    NaN
5  NaN  NaN   NaN     NaN    NaN

That's the advantage of **query**:

In [47]:
friends.query('~girl').query('age==age.min()')
#operating on the last subset - this is the advantage of query!

    name  age   girl born In  degree
2  Pablo   28  False   Spain  Master

In [49]:
#but

students=friends.copy() #making a copy of friends
#unlike in R , if you don't make a copy of friends, even if it has a new name - 
#'whatever you do to students will happen to friends'
#because when you are working in networks, independent copies could be a mess

students.where(~students.girl,inplace=True) #real subset, 'inplace' makes a subset that changes the original dataframe
students.where(students.age==students.age.min())

#not as efficient! but this is not always wrong - depends on you, readability, understandability etc.

    name   age  girl born In  degree
0    NaN   NaN   NaN     NaN     NaN
1    NaN   NaN   NaN     NaN     NaN
2  Pablo  28.0   0.0   Spain  Master
3    NaN   NaN   NaN     NaN     NaN
4    NaN   NaN   NaN     NaN     NaN
5    NaN   NaN   NaN     NaN     NaN

Let's vary the data a little:

In [50]:
names=["Tom√°s", "Pauline", "Pablo", "Bjork","Alan","Juana"]
woman=[False,True,False,False,False,True]
ages=[32,28,28,30,32,27]
country=["Chile", "Senegal", "Spain", "Norway","Peru","Peru"]
education=["Bach", "Bach", "Master", "PhD","Bach","Master"]

# now in a dict:
data={'name':names, 'age':ages, 'girl':woman,'born In':country, 'degree':education}

#now into a DF
import pandas as pd

friends2=pd.DataFrame.from_dict(data)
# seeing it:
friends2

      name  age   girl  born In  degree
0    Tom√°s   32  False    Chile    Bach
1  Pauline   28   True  Senegal    Bach
2    Pablo   28  False    Spain  Master
3    Bjork   30  False   Norway     PhD
4     Alan   32  False     Peru    Bach
5    Juana   27   True     Peru  Master

There is a girl with the same age as the youngest boy, then:

In [51]:
friends2.where(friends2.age==friends2[~friends2.girl].age.min()).dropna()

      name   age  girl  born In  degree
1  Pauline  28.0   1.0  Senegal    Bach
2    Pablo  28.0   0.0    Spain  Master

We need a previous strategy:

In [52]:
# bad implementation:
friends2.where(friends2.age==friends2[~friends2.girl].age.min() & friends2.girl==False).dropna()

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [53]:
# bad implementation:
friends2.where(friends2.age==friends2[~friends2.girl].age.min() & ~friends2.girl).dropna()

Empty DataFrame
Columns: [name, age, girl, born In, degree]
Index: []

In [54]:
# just parentheses to make it work!
friends2.where((friends2.age==friends2[~friends2.girl].age.min()) & (~friends2.girl)).dropna()

    name   age  girl born In  degree
2  Pablo  28.0   0.0   Spain  Master

This one still works!

In [58]:
friends2.query('~girl').query('age==age.min()')
#query is super efficient!

    name  age   girl born In  degree
2  Pablo   28  False   Spain  Master

In [56]:
students2=friends2.copy()

students2.where(~students2.girl,inplace=True) #real subset
students2.where(students2.age==students2.age.min()).dropna()

    name   age  girl born In  degree
2  Pablo  28.0   0.0   Spain  Master